#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + id        = (known after apply)
      + name      = "ICY-Richmond-Team-3-Non-Clinical-Team-Member"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ICY.module.client-roles.keycloak_role.ROLES["ICY-Richmond-Team-3-Program-Leader"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "ICY-Richmond-Team-3-Program-Leader"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ICY.module.client-roles.keycloak_role.ROLES["ICY-Richmond-Team-4-Admin"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "ICY-Richmond-Team-4-Admin"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ICY.module.client-roles.keycloak_role.ROLES["ICY-Richmond-Team-4-Clinical-Team-Member"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "ICY-Richmond-Team-4-Clinical-Team-Member"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ICY.module.client-roles.keycloak_role.ROLES["ICY-Richmond-Team-4-Non-Clinical-Team-Member"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "ICY-Richmond-Team-4-Non-Clinical-Team-Member"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ICY.module.client-roles.keycloak_role.ROLES["ICY-Richmond-Team-4-Program-Leader"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "ICY-Richmond-Team-4-Program-Leader"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ICY.module.client-roles.keycloak_role.ROLES["ICY-qathet-Powell-River-Team-1-Admin"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "ICY-qathet-Powell-River-Team-1-Admin"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ICY.module.client-roles.keycloak_role.ROLES["ICY-qathet-Powell-River-Team-1-Clinical-Team-Member"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "ICY-qathet-Powell-River-Team-1-Clinical-Team-Member"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ICY.module.client-roles.keycloak_role.ROLES["ICY-qathet-Powell-River-Team-1-Non-Clinical-Team-Member"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "ICY-qathet-Powell-River-Team-1-Non-Clinical-Team-Member"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ICY.module.client-roles.keycloak_role.ROLES["ICY-qathet-Powell-River-Team-1-Program-Leader"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "ICY-qathet-Powell-River-Team-1-Program-Leader"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-icy"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "cc4d80a5-4a1c-4d80-a2c3-59d3ebde880d"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-icy"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + name      = "view-client-icy"
      + realm_id  = "moh_applications"
    }

Plan: 98 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*